# CornerPostCondition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PostPattern..::..CornerPostCondition Property
PostPattern Class See Also
---
The condition which controls the insertion of corner posts.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public BreakCornerCondition CornerPostCondition { get; set; }
```

Visual Basic
---
```text
Public Property CornerPostCondition As BreakCornerCondition
	Get
	Set
```

Visual C++
---
```text
public:
property BreakCornerCondition CornerPostCondition {
	BreakCornerCondition get ();
	void set (BreakCornerCondition value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace